In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from numpy.random import randn
from IPython.display import YouTubeVideo
from pandas_datareader import data, wb
import pandas_datareader as pdweb
import datetime
import seaborn as sns
import matplotlib.pyplot as plt 
from seaborn.regression import coefplot

In [11]:
data = Series(['one','two',np.nan,'four'])

In [12]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [13]:
# removes null
data.dropna()

0     one
1     two
3    four
dtype: object

In [14]:
dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])

In [15]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [16]:
clean_dframe = dframe.dropna()

In [17]:
clean_dframe

     0    1    2
0  1.0  2.0  3.0

In [18]:
dframe.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [19]:
npn = np.nan
dframe2 = DataFrame([[1,2,3,npn],[2,npn,5,6],[npn,7,npn,9],[npn,npn,npn,npn]])

In [20]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  NaN  NaN  NaN  NaN

In [29]:
dframe2.dropna(thresh=3)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [30]:
dframe2.fillna(1)

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [32]:
dframe2.fillna({0:0,1:1,2:2,3:3})

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  0.0  1.0  2.0  3.0

In [33]:
dframe2.fillna(0,inplace=True)

In [34]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  0.0  0.0  0.0  0.0